app/controllers/comments_controller.rb

  def index
    @post = Post.find(params[:post_id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "13"]]

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.new(params[:comment])
    respond_to do |format|
      if @comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "13"]]
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?)  [["body", "rtertert"], ["created_at", Tue, 10 Nov 2015 13:01:03 UTC +00:00], ["post_id", 13], ["updated_at", Tue, 10 Nov 2015 13:01:03 UTC +00:00]]